Fo-Zi/nexus-llhal-stm32f103/src/stm32f103_helpers.c
#include "stm32f103_helpers.h"
#include <stddef.h>

static stm32f103_clock_frequencies_t g_clock_frequencies = {0};
static uint32_t g_sysclk_hz = 8000000; // default after reset (HSI=8 MHz)
static bool g_clock_frequencies_valid = false;

/*==============================================================================
 * Forward Declarations for Static Helper Functions
 *============================================================================*/
static int wait_for_flag_set(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_us);
static int wait_for_flag_match(volatile uint32_t *reg, uint32_t mask, uint32_t expected, uint32_t timeout_us);
static int wait_for(volatile uint32_t *reg, uint32_t mask, uint32_t expect, uint32_t timeout);

/*==============================================================================
 * Static Helper Functions for Clock Configuration
 *============================================================================*/

static uint32_t get_ahb_prescaler_value(stm32f103_ahb_prescaler_t prescaler) {
    switch (prescaler) {
        case STM32F103_AHB_DIV_1:   return 0x0;
        case STM32F103_AHB_DIV_2:   return 0x8;
        case STM32F103_AHB_DIV_4:   return 0x9;
        case STM32F103_AHB_DIV_8:   return 0xA;
        case STM32F103_AHB_DIV_16:  return 0xB;
        case STM32F103_AHB_DIV_64:  return 0xC;
        case STM32F103_AHB_DIV_128: return 0xD;
        case STM32F103_AHB_DIV_256: return 0xE;
        case STM32F103_AHB_DIV_512: return 0xF;
        default: return 0x0;
    }
}

static uint32_t get_apb_prescaler_value(stm32f103_apb_prescaler_t prescaler) {
    switch (prescaler) {
        case STM32F103_APB_DIV_1:  return 0x0;
        case STM32F103_APB_DIV_2:  return 0x4;
        case STM32F103_APB_DIV_4:  return 0x5;
        case STM32F103_APB_DIV_8:  return 0x6;
        case STM32F103_APB_DIV_16: return 0x7;
        default: return 0x0;
    }
}

static uint32_t get_adc_prescaler_value(stm32f103_adc_prescaler_t prescaler) {
    switch (prescaler) {
        case STM32F103_ADC_DIV_2: return 0x0;
        case STM32F103_ADC_DIV_4: return 0x1;
        case STM32F103_ADC_DIV_6: return 0x2;
        case STM32F103_ADC_DIV_8: return 0x3;
        default: return 0x0;
    }
}

static uint32_t get_flash_latency_value(stm32f103_flash_latency_t latency) {
    switch (latency) {
        case STM32F103_FLASH_LATENCY_0: return FLASH_ACR_LATENCY_0;
        case STM32F103_FLASH_LATENCY_1: return FLASH_ACR_LATENCY_1;
        case STM32F103_FLASH_LATENCY_2: return FLASH_ACR_LATENCY_2;
        default: return FLASH_ACR_LATENCY_0;
    }
}

static uint32_t get_pll_mul_value(stm32f103_pll_mul_t pll_mul) {
    if (pll_mul < STM32F103_PLL_MUL_2 || pll_mul > STM32F103_PLL_MUL_16) {
        return 0; // Invalid
    }
    return (pll_mul - 2) << RCC_CFGR_PLLMULL_Pos; // PLL_MUL - 2 shifted to position
}

static int configure_hse(bool enable, bool bypass, uint32_t timeout_us) {
    if (enable) {
        // Configure HSE bypass if requested
        if (bypass) {
            RCC_CR |= RCC_CR_HSEBYP;
        } else {
            RCC_CR &= ~RCC_CR_HSEBYP;
        }

        // Enable HSE and wait for ready
        RCC_CR |= RCC_CR_HSEON;
        return wait_for_flag_set(&RCC_CR, RCC_CR_HSERDY, timeout_us);
    } else {
        // Disable HSE
        RCC_CR &= ~(RCC_CR_HSEON | RCC_CR_HSEBYP);
        return 0;
    }
}

static int configure_pll(const stm32f103_clock_config_t *config) {
    // Disable PLL first
    RCC_CR &= ~RCC_CR_PLLON;

    // Wait for PLL to be disabled
    while (RCC_CR & RCC_CR_PLLRDY) { /* spin */ }

    // Configure PLL source and parameters
    uint32_t cfgr = RCC_CFGR;
    cfgr &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMULL_Msk);

    if (config->clock_source == STM32F103_CLOCK_SOURCE_PLL_HSE) {
        cfgr |= RCC_CFGR_PLLSRC_HSE;
        if (config->pll_hse_div2) {
            cfgr |= RCC_CFGR_PLLXTPRE;
        }
    } else {
        cfgr |= RCC_CFGR_PLLSRC_HSI;  // HSI/2 as PLL source
    }

    cfgr |= get_pll_mul_value(config->pll_mul);
    RCC_CFGR = cfgr;

    // Enable PLL and wait for ready
    RCC_CR |= RCC_CR_PLLON;
    return wait_for_flag_set(&RCC_CR, RCC_CR_PLLRDY, HSE_STARTUP_TIMEOUT);
}

static int configure_flash_latency(const stm32f103_clock_config_t *config) {
    uint32_t acr = FLASH_ACR;
    acr &= ~FLASH_ACR_LATENCY_Msk;
    acr |= get_flash_latency_value(config->flash_latency);

    if (config->flash_prefetch_enable) {
        acr |= FLASH_ACR_PRFTBE;
    } else {
        acr &= ~FLASH_ACR_PRFTBE;
    }

    FLASH_ACR = acr;
    return 0;
}

static int configure_bus_prescalers(const stm32f103_clock_config_t *config) {
    uint32_t cfgr = RCC_CFGR;

    // Clear prescaler fields
    cfgr &= ~(RCC_CFGR_HPRE_Msk | RCC_CFGR_PPRE1_Msk | RCC_CFGR_PPRE2_Msk | RCC_CFGR_ADCPRE_Msk);

    // Set prescalers
    cfgr |= get_ahb_prescaler_value(config->ahb_prescaler) << RCC_CFGR_HPRE_Pos;
    cfgr |= get_apb_prescaler_value(config->apb1_prescaler) << RCC_CFGR_PPRE1_Pos;
    cfgr |= get_apb_prescaler_value(config->apb2_prescaler) << RCC_CFGR_PPRE2_Pos;
    cfgr |= get_adc_prescaler_value(config->adc_prescaler) << RCC_CFGR_ADCPRE_Pos;

    // Configure USB prescaler if using PLL
    if (config->clock_source == STM32F103_CLOCK_SOURCE_PLL_HSE ||
        config->clock_source == STM32F103_CLOCK_SOURCE_PLL_HSI) {
        if (config->usb_prescaler_1_5) {
            cfgr &= ~RCC_CFGR_USBPRE;  // PLL/1.5
        } else {
            cfgr |= RCC_CFGR_USBPRE;   // PLL/1
        }
    }

    RCC_CFGR = cfgr;
    return 0;
}

static int switch_system_clock(stm32f103_clock_source_t source) {
    uint32_t cfgr = RCC_CFGR;
    uint32_t target_sw, target_sws;

    cfgr &= ~RCC_CFGR_SW_Msk;

    switch (source) {
        case STM32F103_CLOCK_SOURCE_HSI:
            target_sw = RCC_CFGR_SW_HSI;
            target_sws = RCC_CFGR_SWS_HSI;
            break;
        case STM32F103_CLOCK_SOURCE_HSE:
            target_sw = RCC_CFGR_SW_HSE;
            target_sws = RCC_CFGR_SWS_HSE;
            break;
        case STM32F103_CLOCK_SOURCE_PLL_HSI:
        case STM32F103_CLOCK_SOURCE_PLL_HSE:
            target_sw = RCC_CFGR_SW_PLL;
            target_sws = RCC_CFGR_SWS_PLL;
            break;
        default:
            return -4; // Invalid clock source
    }

    cfgr |= target_sw;
    RCC_CFGR = cfgr;

    // Wait for system clock switch
    return wait_for_flag_match(&RCC_CFGR, RCC_CFGR_SWS_Msk, target_sws, HSE_STARTUP_TIMEOUT);
}

static int configure_css(bool enable) {
    if (enable) {
        RCC_CR |= RCC_CR_CSSON;
    } else {
        RCC_CR &= ~RCC_CR_CSSON;
    }
    return 0;
}

static int configure_systick(const stm32f103_clock_config_t *config, uint32_t sysclk_hz) {
    if (!config->enable_systick || config->systick_freq_hz == 0) {
        // Disable SysTick
        SYSTICK_CSR &= ~SYSTICK_CSR_ENABLE;
        return 0;
    }

    // Calculate reload value
    uint32_t reload = (sysclk_hz / config->systick_freq_hz) - 1;
    if (reload > 0xFFFFFF) {
        return -5; // SysTick reload value too large
    }

    // Configure SysTick
    SYSTICK_RVR = reload;
    SYSTICK_CVR = 0; // Clear current value
    SYSTICK_CSR = SYSTICK_CSR_CLKSOURCE | SYSTICK_CSR_ENABLE;

