Fo-Zi/nexus-llhal-stm32f103/src/stm32f103_helpers.c
    return 0;
}

static int wait_for_flag_set(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_us) {
    uint32_t countdown = timeout_us;
    while (countdown-- && !(*reg & mask)) {
        __asm("nop");
    }
    return (*reg & mask) ? 0 : -1;
}

static int wait_for_flag_match(volatile uint32_t *reg, uint32_t mask, uint32_t expected, uint32_t timeout_us) {
    uint32_t countdown = timeout_us;
    while (countdown-- && ((*reg & mask) != expected)) {
        __asm("nop");
    }
    return ((*reg & mask) == expected) ? 0 : -1;
}

static int wait_for(volatile uint32_t *reg, uint32_t mask, uint32_t expect, uint32_t timeout) {
    while (timeout--) {
        if (((*reg) & mask) == expect) return 0;
    }
    return -1;
}

static void calculate_frequencies(const stm32f103_clock_config_t *config,
                                 stm32f103_clock_frequencies_t *freq) {
    uint32_t sysclk = 0;

    switch (config->clock_source) {
        case STM32F103_CLOCK_SOURCE_HSI:
            sysclk = STM32F103_HSI_FREQ_HZ;
            break;

        case STM32F103_CLOCK_SOURCE_HSE:
            sysclk = config->hse_freq_hz;
            break;

        case STM32F103_CLOCK_SOURCE_PLL_HSI: {
            uint32_t pll_input = STM32F103_HSI_FREQ_HZ / 2;
            sysclk = pll_input * config->pll_mul;
            break;
        }

        case STM32F103_CLOCK_SOURCE_PLL_HSE: {
            uint32_t pll_input = config->hse_freq_hz;
            if (config->pll_hse_div2) {
                pll_input /= 2;
            }
            sysclk = pll_input * config->pll_mul;
            break;
        }
    }

    freq->sysclk_hz = sysclk;
    freq->hclk_hz = sysclk / config->ahb_prescaler;
    freq->pclk1_hz = freq->hclk_hz / config->apb1_prescaler;
    freq->pclk2_hz = freq->hclk_hz / config->apb2_prescaler;
    freq->adcclk_hz = freq->pclk2_hz / config->adc_prescaler;

    if (config->clock_source == STM32F103_CLOCK_SOURCE_PLL_HSI ||
        config->clock_source == STM32F103_CLOCK_SOURCE_PLL_HSE) {
        if (config->usb_prescaler_1_5) {
            freq->usbclk_hz = (sysclk * 2) / 3;
        } else {
            freq->usbclk_hz = sysclk;
        }
    } else {
        freq->usbclk_hz = 0;
    }
}

int stm32f103_validate_clock_config(const stm32f103_clock_config_t *config,
                                    stm32f103_clock_frequencies_t *expected_freq) {
    if (!config) return -1;

    stm32f103_clock_frequencies_t freq;
    calculate_frequencies(config, &freq);

    if (freq.sysclk_hz > 72000000) return -1;
    if (freq.hclk_hz > 72000000) return -1;
    if (freq.pclk1_hz > 36000000) return -1;
    if (freq.pclk2_hz > 72000000) return -1;
    if (freq.adcclk_hz > 14000000) return -1;

    if (freq.usbclk_hz != 0 && freq.usbclk_hz != 48000000) return -1;

    if (config->pll_mul < STM32F103_PLL_MUL_2 || config->pll_mul > STM32F103_PLL_MUL_16) return -1;

    if ((config->clock_source == STM32F103_CLOCK_SOURCE_HSE ||
         config->clock_source == STM32F103_CLOCK_SOURCE_PLL_HSE) &&
        config->hse_freq_hz == 0) return -1;

    if (expected_freq) {
        *expected_freq = freq;
    }

    return 0;
}

/*==============================================================================
 * Comprehensive Clock Configuration Implementation
 *============================================================================*/

int stm32f103_clock_init(const stm32f103_clock_config_t *config,
                         stm32f103_clock_frequencies_t *frequencies) {
    if (!config) {
        return -1; // Invalid configuration
    }

    // Validate configuration first
    stm32f103_clock_frequencies_t expected_freq;
    int validation_result = stm32f103_validate_clock_config(config, &expected_freq);
    if (validation_result != 0) {
        return validation_result;
    }

    // Save current system state for error recovery
    uint32_t original_cr = RCC_CR;
    uint32_t original_cfgr = RCC_CFGR;
    uint32_t original_acr = FLASH_ACR;

    // Step 1: Enable HSI as a safe fallback
    RCC_CR |= RCC_CR_HSION;
    if (wait_for_flag_set(&RCC_CR, RCC_CR_HSIRDY, HSE_STARTUP_TIMEOUT) != 0) {
        return -1; // HSI failed to start
    }

    // Step 2: Switch to HSI temporarily for safe configuration
    if (switch_system_clock(STM32F103_CLOCK_SOURCE_HSI) != 0) {
        return -4; // Failed to switch to HSI
    }

    // Step 3: Configure Flash latency BEFORE increasing frequency
    if (configure_flash_latency(config) != 0) {
        goto error_recovery;
    }

    // Step 4: Configure HSE if needed
    bool need_hse = (config->clock_source == STM32F103_CLOCK_SOURCE_HSE ||
                     config->clock_source == STM32F103_CLOCK_SOURCE_PLL_HSE);

    if (need_hse) {
        if (configure_hse(true, config->hse_bypass, HSE_STARTUP_TIMEOUT) != 0) {
            goto error_recovery; // HSE failed to start
        }
    }

    // Step 5: Configure bus prescalers
    if (configure_bus_prescalers(config) != 0) {
        goto error_recovery;
    }

    // Step 6: Configure PLL if needed
    bool need_pll = (config->clock_source == STM32F103_CLOCK_SOURCE_PLL_HSI ||
                     config->clock_source == STM32F103_CLOCK_SOURCE_PLL_HSE);

    if (need_pll) {
        if (configure_pll(config) != 0) {
            goto error_recovery; // PLL failed to start
        }
    }

    // Step 7: Switch to final system clock
    if (switch_system_clock(config->clock_source) != 0) {
        goto error_recovery; // Failed to switch to target clock
    }

    // Step 8: Configure Clock Security System
    if (configure_css(config->enable_css) != 0) {
        goto error_recovery;
    }

    // Step 9: Configure SysTick
    if (configure_systick(config, expected_freq.sysclk_hz) != 0) {
        goto error_recovery;
    }

    // Step 10: Disable HSI if not needed (power saving)
    if (config->clock_source != STM32F103_CLOCK_SOURCE_HSI &&
        config->clock_source != STM32F103_CLOCK_SOURCE_PLL_HSI) {
        RCC_CR &= ~RCC_CR_HSION;
    }

    // Step 11: Update global frequency tracking
    g_clock_frequencies = expected_freq;
    g_sysclk_hz = expected_freq.sysclk_hz;
    g_clock_frequencies_valid = true;

