Fo-Zi/nexus-llhal-stm32f103/src/stm32f103_helpers.c
    // Step 12: Initialize DWT for accurate delays
    dwt_init();

    // Return calculated frequencies to caller
    if (frequencies) {
        *frequencies = expected_freq;
    }

    return 0; // Success

error_recovery:
    // Restore original state on error
    RCC_CR = original_cr;
    RCC_CFGR = original_cfgr;
    FLASH_ACR = original_acr;

    // Try to ensure HSI is working
    RCC_CR |= RCC_CR_HSION;
    wait_for_flag_set(&RCC_CR, RCC_CR_HSIRDY, HSE_STARTUP_TIMEOUT);
    switch_system_clock(STM32F103_CLOCK_SOURCE_HSI);

    return -3; // Configuration failed, system restored to safe state
}

/*==============================================================================
 * Legacy Clock Configuration Functions (for backward compatibility)
 *============================================================================*/

int stm32f103_default_8mhz_internal_clock_init(){

    /* Safe fallback path: ensure HSI is running and select it as SYSCLK */
    RCC_CR |= RCC_CR_HSION;
    /* Wait until HSIRDY (HSI is expected to be available quickly) */
    wait_for(&RCC_CR,RCC_CR_HSIRDY, RCC_CR_HSIRDY, 0x1FFFFF);

    /* Disable PLL (if it was on) and HSE to clean state */
    RCC_CR &= ~RCC_CR_PLLON;
    RCC_CR &= ~RCC_CR_HSEON;
    /* Switch system clock to HSI */
    RCC_CFGR = (RCC_CFGR & ~RCC_CFGR_SW_Msk) | RCC_CFGR_SW_HSI;
    /* Wait for SWS to indicate HSI */

    wait_for(&RCC_CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_HSI, 0x1FFFFF);
    // while (((RCC_CFGR & RCC_CFGR_SWS_HSI) != RCC_CFGR_SWS_HSI) && timeout--) {
    //     __asm("nop");
    // }

    g_sysclk_hz = 8000000;
    g_clock_frequencies_valid = true;

    return 0;

}

int stm32f103_default_72mhz_clock_init(){

    uint32_t tmp;

    /* 1) RCC_CR |= RCC_CR_HSEBYP;  // only if using external clock signal (not crystal) */

    /* 2) Enable HSE and wait for HSERDY */
    RCC_CR |= RCC_CR_HSEON;
    if (wait_for(&RCC_CR, RCC_CR_HSERDY, RCC_CR_HSERDY, 0x1FFFFF)) {
        /* HSE failed to start — handle error */
        stm32f103_default_8mhz_internal_clock_init();
        return 0;
    }

    /* 3) Set Flash latency = 2WS and enable prefetch (needed for 72 MHz) */
    tmp = FLASH_ACR & ~FLASH_ACR_LATENCY_Msk;
    tmp |= FLASH_ACR_LATENCY_2;   /* 2 wait states */
    tmp |= FLASH_ACR_PRFTBE;      /* enable prefetch buffer */
    FLASH_ACR = tmp;

    /* 4) Configure prescalers: AHB = SYSCLK, APB1 = HCLK/2 (<=36MHz), APB2 = HCLK */
    tmp = RCC_CFGR & ~(RCC_CFGR_HPRE_Msk | RCC_CFGR_PPRE1_Msk | RCC_CFGR_PPRE2_Msk);
    tmp |= RCC_CFGR_PPRE1_DIV2; /* APB1 = HCLK/2 */
    RCC_CFGR = tmp;

    /* 5) Configure PLL: PLLSRC = HSE, PLLXTPRE = 0 (HSE not divided), PLLMUL = x9 */
    tmp = RCC_CFGR & ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMULL_Msk);
    tmp |= RCC_CFGR_PLLSRC_HSE;    /* PLL source = HSE */
    tmp |= RCC_CFGR_PLLMULL9;      /* PLL multiplication = 9 */
    RCC_CFGR = tmp;

    /* 6) Enable PLL, wait for PLLRDY */
    RCC_CR |= RCC_CR_PLLON;
    if (wait_for(&RCC_CR, RCC_CR_PLLRDY, RCC_CR_PLLRDY, 0x1FFFFF)) {
        /* PLL failed to lock — handle error */
        stm32f103_default_8mhz_internal_clock_init();
        return 0;
    }

    /* 7) Select PLL as system clock and wait for switch */
    tmp = RCC_CFGR & ~RCC_CFGR_SW_Msk;
    tmp |= RCC_CFGR_SW_PLL;    /* SW = PLL */
    RCC_CFGR = tmp;
    /* Wait for system clock switch to complete */
    while ((RCC_CFGR & RCC_CFGR_SWS_Msk) != RCC_CFGR_SWS_PLL) { /* spin */ }

    /* 8) (Optional) turn off HSI to save power */
    RCC_CR &= ~RCC_CR_HSION;

    g_sysclk_hz = 72000000;
    g_clock_frequencies_valid = true;

    return 0;

}

/*==============================================================================
 * Pre-configured Clock Settings (Common Configurations)
 *============================================================================*/

void stm32f103_get_default_72mhz_config(stm32f103_clock_config_t *config) {
    if (!config) return;

    config->clock_source = STM32F103_CLOCK_SOURCE_PLL_HSE;
    config->hse_freq_hz = 8000000;
    config->hse_bypass = false;
    config->pll_mul = STM32F103_PLL_MUL_9;
    config->pll_hse_div2 = false;
    config->ahb_prescaler = STM32F103_AHB_DIV_1;
    config->apb1_prescaler = STM32F103_APB_DIV_2;
    config->apb2_prescaler = STM32F103_APB_DIV_1;
    config->adc_prescaler = STM32F103_ADC_DIV_6;
    config->flash_latency = STM32F103_FLASH_LATENCY_2;
    config->flash_prefetch_enable = true;
    config->usb_prescaler_1_5 = true;
    config->enable_css = true;
    config->enable_systick = true;
    config->systick_freq_hz = 1000;
}

void stm32f103_get_default_48mhz_hsi_config(stm32f103_clock_config_t *config) {
    if (!config) return;

    config->clock_source = STM32F103_CLOCK_SOURCE_PLL_HSI;
    config->hse_freq_hz = 0;
    config->hse_bypass = false;
    config->pll_mul = STM32F103_PLL_MUL_12;
    config->pll_hse_div2 = false;
    config->ahb_prescaler = STM32F103_AHB_DIV_1;
    config->apb1_prescaler = STM32F103_APB_DIV_2;
    config->apb2_prescaler = STM32F103_APB_DIV_1;
    config->adc_prescaler = STM32F103_ADC_DIV_6;
    config->flash_latency = STM32F103_FLASH_LATENCY_1;
    config->flash_prefetch_enable = true;
    config->usb_prescaler_1_5 = false;
    config->enable_css = false;
    config->enable_systick = true;
    config->systick_freq_hz = 1000;
}

void stm32f103_get_default_8mhz_hsi_config(stm32f103_clock_config_t *config) {
    if (!config) return;

    config->clock_source = STM32F103_CLOCK_SOURCE_HSI;
    config->hse_freq_hz = 0;
    config->hse_bypass = false;
    config->pll_mul = STM32F103_PLL_MUL_2; // Not used for HSI direct
    config->pll_hse_div2 = false;
    config->ahb_prescaler = STM32F103_AHB_DIV_1;
    config->apb1_prescaler = STM32F103_APB_DIV_1;
    config->apb2_prescaler = STM32F103_APB_DIV_1;
    config->adc_prescaler = STM32F103_ADC_DIV_2;
    config->flash_latency = STM32F103_FLASH_LATENCY_0;
    config->flash_prefetch_enable = false;
    config->usb_prescaler_1_5 = false;
    config->enable_css = false;
    config->enable_systick = true;
    config->systick_freq_hz = 1000;
}

/*==============================================================================
 * GPIO Helper Functions
 *============================================================================*/

uint32_t stm32f103_get_gpio_base(stm32f103_gpio_port_t port) {
    switch (port) {
        case STM32F103_GPIO_PORT_A: return GPIOA_BASE;
        case STM32F103_GPIO_PORT_B: return GPIOB_BASE;
        case STM32F103_GPIO_PORT_C: return GPIOC_BASE;
        case STM32F103_GPIO_PORT_D: return GPIOD_BASE;
        case STM32F103_GPIO_PORT_E: return GPIOE_BASE;
        default: return 0;
    }
}

uint32_t stm32f103_get_gpio_clk_mask(stm32f103_gpio_port_t port) {
    switch (port) {
        case STM32F103_GPIO_PORT_A: return RCC_APB2ENR_IOPAEN;
        case STM32F103_GPIO_PORT_B: return RCC_APB2ENR_IOPBEN;
        case STM32F103_GPIO_PORT_C: return RCC_APB2ENR_IOPCEN;
        case STM32F103_GPIO_PORT_D: return RCC_APB2ENR_IOPDEN;
        case STM32F103_GPIO_PORT_E: return RCC_APB2ENR_IOPEEN;
        default: return 0;
    }
}

/*==============================================================================
 * Timing and Delay Functions
 *============================================================================*/

void dwt_init(void) {
    SCB_DEMCR |= SCB_DEMCR_TRCENA;          // enable trace
    DWT_CYCCNT = 0;                         // reset cycle counter
    DWT_CTRL |= DWT_CTRL_CYCCNTENA;         // enable cycle counter
}

void stm32f103_delay_us(uint32_t microseconds) {
    if (microseconds == 0) return;

      uint32_t cycles = (uint64_t)g_sysclk_hz * microseconds / 1000000ULL;
      uint32_t start = DWT_CYCCNT;

      while ((DWT_CYCCNT - start) < cycles) {
          __asm__ volatile ("nop");
      }
    // uint32_t cycles = (g_sysclk_hz / 1000000U) * microseconds;
    // uint32_t start = DWT_CYCCNT;
    // while ((DWT_CYCCNT - start) < cycles) {
    //     __asm__ volatile ("nop");
    // }
}

void stm32f103_delay_ms(uint32_t milliseconds) {
    while (milliseconds--) {
        stm32f103_delay_us(1000);
    }
}

/*==============================================================================
 * Clock Information and Status Functions
 *============================================================================*/

