Fo-Zi/nexus-llhal-stm32f103/src/stm32f103_helpers.c
uint32_t stm32f103_get_sysclk_hz(void) {
    return g_clock_frequencies.sysclk_hz;
}

int stm32f103_set_clock_frequencies(const stm32f103_clock_frequencies_t *frequencies) {
    if (!frequencies) {
        return -1;
    }

    g_clock_frequencies = *frequencies;
    g_clock_frequencies_valid = true;
    return 0;
}

int stm32f103_get_clock_frequencies(stm32f103_clock_frequencies_t *frequencies) {
    if (!frequencies) {
        return -1;
    }

    *frequencies = g_clock_frequencies;
    return 0;
}

int stm32f103_detect_clock_frequencies(void) {
    stm32f103_clock_frequencies_t detected = {0};

    // Read current clock source from RCC_CFGR SWS bits
    uint32_t sws = (RCC_CFGR & RCC_CFGR_SWS_Msk) >> RCC_CFGR_SWS_Pos;

    switch (sws) {
        case 0x0: // HSI
            detected.sysclk_hz = STM32F103_HSI_FREQ_HZ;
            break;

        case 0x1: // HSE
            // Need to detect HSE frequency - assume 8MHz for Blue Pill
            detected.sysclk_hz = 8000000;
            break;

        case 0x2: { // PLL
            // Read PLL configuration
            uint32_t pllmul = ((RCC_CFGR & RCC_CFGR_PLLMULL_Msk) >> RCC_CFGR_PLLMULL_Pos) + 2;
            uint32_t pllsrc = (RCC_CFGR & RCC_CFGR_PLLSRC) ? 1 : 0;
            uint32_t pllxtpre = (RCC_CFGR & RCC_CFGR_PLLXTPRE) ? 1 : 0;

            uint32_t pll_input;
            if (pllsrc == 0) {
                // HSI/2 as PLL source
                pll_input = STM32F103_HSI_FREQ_HZ / 2;
            } else {
                // HSE as PLL source
                pll_input = 8000000; // Assume 8MHz HSE for Blue Pill
                if (pllxtpre) {
                    pll_input /= 2;
                }
            }

            detected.sysclk_hz = pll_input * pllmul;
            break;
        }

        default:
            return -1; // Unknown clock source
    }

    // Calculate other frequencies from prescalers
    uint32_t hpre = (RCC_CFGR & RCC_CFGR_HPRE_Msk) >> RCC_CFGR_HPRE_Pos;
    uint32_t ppre1 = (RCC_CFGR & RCC_CFGR_PPRE1_Msk) >> RCC_CFGR_PPRE1_Pos;
    uint32_t ppre2 = (RCC_CFGR & RCC_CFGR_PPRE2_Msk) >> RCC_CFGR_PPRE2_Pos;
    uint32_t adcpre = (RCC_CFGR & RCC_CFGR_ADCPRE_Msk) >> RCC_CFGR_ADCPRE_Pos;

    // AHB prescaler
    if (hpre < 8) {
        detected.hclk_hz = detected.sysclk_hz;
    } else {
        uint32_t ahb_div = 1 << (hpre - 7);
        detected.hclk_hz = detected.sysclk_hz / ahb_div;
    }

    // APB1 prescaler
    if (ppre1 < 4) {
        detected.pclk1_hz = detected.hclk_hz;
    } else {
        uint32_t apb1_div = 1 << (ppre1 - 3);
        detected.pclk1_hz = detected.hclk_hz / apb1_div;
    }

    // APB2 prescaler
    if (ppre2 < 4) {
        detected.pclk2_hz = detected.hclk_hz;
    } else {
        uint32_t apb2_div = 1 << (ppre2 - 3);
        detected.pclk2_hz = detected.hclk_hz / apb2_div;
    }

    // ADC prescaler
    uint32_t adc_divs[] = {2, 4, 6, 8};
    detected.adcclk_hz = detected.pclk2_hz / adc_divs[adcpre];

    // USB clock (only valid for PLL source)
    if (sws == 0x2) {
        bool usbpre = (RCC_CFGR & RCC_CFGR_USBPRE);
        if (!usbpre) {
            detected.usbclk_hz = (detected.sysclk_hz * 2) / 3; // PLL / 1.5
        } else {
            detected.usbclk_hz = detected.sysclk_hz; // PLL / 1
        }
    }

    g_clock_frequencies = detected;
    g_clock_frequencies_valid = true;

    return 0;
}

/*==============================================================================
 * Debug UART Functions (UART1 - PA9/PA10)
 *============================================================================*/

static volatile bool uart_debug_initialized = false;

int stm32f103_uart_debug_init(void) {
    if (uart_debug_initialized) return 0;

    // Enable UART1 and GPIOA clocks using utility function
    stm32f103_enable_peripheral_clock(0x18, RCC_APB2ENR_USART1EN); // APB2ENR offset
    stm32f103_enable_peripheral_clock(0x18, RCC_APB2ENR_IOPAEN);

    // Configure PA9 (TX) as alternate function push-pull, 50MHz
    stm32f103_configure_gpio_pin(GPIOA_BASE, 9, GPIO_MODE_OUTPUT_50M, GPIO_CNF_OUTPUT_AF_PUSHPULL);

    // Configure PA10 (RX) as input floating
    stm32f103_configure_gpio_pin(GPIOA_BASE, 10, GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOATING);

    // Configure UART1: 115200 baud using utility function
    uint32_t pclk2_hz = g_clock_frequencies_valid ? g_clock_frequencies.pclk2_hz : STM32F103_HSI_FREQ_HZ;
    USART1_BRR = stm32f103_calculate_uart_brr(pclk2_hz, 115200);

    // Enable TX, RX, and UART
    USART1_CR1 = USART_CR1_TE | USART_CR1_RE | USART_CR1_UE;

    uart_debug_initialized = true;
    return 0;
}

void stm32f103_uart_debug_print(const char* str) {
    if (!uart_debug_initialized) return;

    while (*str) {
        // Wait for transmit register empty
        while (!(USART1_SR & USART_SR_TXE));
        USART1_DR = *str++;
    }
}

void stm32f103_uart_debug_print_num(const char* str, uint32_t num) {
    if (!uart_debug_initialized) return;

    stm32f103_uart_debug_print(str);

    // Convert to decimal string
    char dec_str[12];  // Max uint32_t is 4294967295 (10 digits) + '\0'
    int pos = 10;
    dec_str[11] = '\0';

    if (num == 0) {
        dec_str[pos--] = '0';
    } else {
        while (num > 0) {
            dec_str[pos--] = '0' + (num % 10);
            num /= 10;
        }
    }

    stm32f103_uart_debug_print(&dec_str[pos + 1]);
}

void stm32f103_uart_debug_deinit(void) {
    if (!uart_debug_initialized) return;

    // Disable UART
    USART1_CR1 = 0;

    // Reset GPIO pins to input floating (reset state)
    GPIO_CRH(GPIOA_BASE) &= ~(0xFF << 4); // Clear PA9 and PA10 config
    GPIO_CRH(GPIOA_BASE) |= (0x44 << 4);  // Set both to input floating

    uart_debug_initialized = false;
}

/*==============================================================================
 * Additional Utility Functions
 *============================================================================*/

bool stm32f103_is_pll_ready(void) {
    return (RCC_CR & RCC_CR_PLLRDY) != 0;
}

bool stm32f103_is_hse_ready(void) {
    return (RCC_CR & RCC_CR_HSERDY) != 0;
}

bool stm32f103_is_hsi_ready(void) {
    return (RCC_CR & RCC_CR_HSIRDY) != 0;
}

stm32f103_clock_source_t stm32f103_get_current_clock_source(void) {
    uint32_t sws = (RCC_CFGR & RCC_CFGR_SWS_Msk) >> RCC_CFGR_SWS_Pos;

    switch (sws) {
        case 0x0: return STM32F103_CLOCK_SOURCE_HSI;
        case 0x1: return STM32F103_CLOCK_SOURCE_HSE;
        case 0x2: {
            // PLL is active, determine if it's HSI or HSE based
            bool pll_src_hse = (RCC_CFGR & RCC_CFGR_PLLSRC);
            return pll_src_hse ? STM32F103_CLOCK_SOURCE_PLL_HSE : STM32F103_CLOCK_SOURCE_PLL_HSI;
        }
        default: return STM32F103_CLOCK_SOURCE_HSI; // Fallback
    }
}

    while (1) { __asm("nop"); }
}

uint32_t stm32f103_calculate_uart_brr(uint32_t peripheral_clock_hz, uint32_t baudrate) {
    return (peripheral_clock_hz + (baudrate / 2)) / baudrate; // Round to nearest
}

void stm32f103_configure_gpio_pin(uint32_t gpio_base, uint8_t pin, uint8_t mode, uint8_t cnf) {
    if (pin > 15) return; // Invalid pin

    volatile uint32_t *cr_reg = (pin < 8) ?
        (volatile uint32_t *)(gpio_base + 0x00) : // CRL
        (volatile uint32_t *)(gpio_base + 0x04);  // CRH

    uint8_t shift = (pin % 8) * 4;
    uint32_t mask = 0xF << shift;
    uint32_t config = ((cnf << 2) | mode) << shift;

    *cr_reg = (*cr_reg & ~mask) | config;
}
